# Lesson 11: SQL Part 2 Studio

> This studio asks you to create queries using the functions from this lesson. As you work through the studio, you may need to create more than one query to return the desired answer.  For others, you may need to combine functions together in order to answer the original query.  The questions have been organized in a way to help you puzzle out the answers.
> 
> Happy querying! 

**The Dataset:**   

> We will be working with the **BooksDB dataset** from Lesson 10.  You should already have access to it.

## The Questions:

1.  Create a query that returns the longest title in the dataset.  We can do this in two steps.

> A. Create a query that returns the length of the longest title.
> 
> B. Create a query that uses the length you found in step A to find the longest title.

In [ ]:
-- Code here:
SELECT TOP 1 title FROM dbo.books
WHERE len(title) = (SELECT MAX(len(title)) FROM dbo.books)

SELECT TOP 1 LEN(title) AS 'Length of Longest Title' FROM dbo.books
WHERE len(title) = (SELECT MAX(len(title)) FROM dbo.books)

In [ ]:
--PART B
SELECT TOP 1 LEN (title) AS 'Length of Longest Title',
title AS 'Longest Title'
FROM dbo.books ORDER BY [Length of Longest Title] DESC

2.  Use what you learned in question 1 to find the shortest author name.  

> A. Create a query that returns the length of the shortest author.
> 
> B. Create a query that returns the shortest author's name.

In [ ]:
-- Code here:
--PART A
SELECT TOP 1 LEN(authors) AS 'Length of Name'
FROM dbo.books
ORDER BY [Length of Name] ASC

--PART B
SELECT TOP 1 authors FROM dbo.books
WHERE len(authors) = (SELECT min(len(authors)) FROM dbo.books)

3\. How many titles contain the word "The"?  

  

> A. Is there a difference between the number of titles that use "The" or "the"?

In [ ]:
-- Code here:
SELECT title FROM dbo.books
WHERE title LIKE '%The%' or title LIKE '%the%'

--Doesn't seem like there is a difference

4.  How many authors' names _start_ with 'Z'?

In [ ]:
-- Code here:
SELECT authors FROM dbo.books
WHERE authors LIKE 'Z%';
--11 Authors names start with 'Z'

5\. How many books have been identified as printed in a language other than English?  There are four language codes for English: 'en', 'eng', 'en-US', and 'en-UK'.  Use LEFT to answer the question.  (Do not use the wildcard)

You might want to use one of these [comparison operators](https://docs.microsoft.com/en-us/sql/t-sql/language-elements/comparison-operators-transact-sql?view=sql-server-ver15).

In [ ]:
-- Code here:
SELECT language_code, book_id AS 'Books Printed in Other language' FROM dbo.books 
WHERE LEFT(language_code, 3) <> 'en'
AND LEFT(language_code, 3) <> 'eng'
AND LEFT(language_code, 5) <> 'en-US'
AND LEFT(language_code, 5) <> 'en-UK'
-- 501 books are printed in other language codes (feel like en-CA, and en-GB are probably also considered english)


--AND language_code != 'eng'
--AND language_code != 'en-US'
--AND language_code != 'en-UK'

6\. Retry question 5 using SUBSTRING.

In [ ]:
-- Code here:
--counting en-CA and en-GB as english, we get 186 instead
SELECT COUNT(language_code )FROM dbo.books
WHERE SUBSTRING (language_code,1,2) != 'en'

7.  Create a column that returns the title, authors, and language codes.  Concatenate these elements so that they return in the following way: title by authors in language\_code language.

> A.  Check each selected column to see where any values are NULL.  Did any of the columns contain NULL values?  If so, which one?

In [ ]:
-- Code here:
--WHERE title IS NULL OR authors IS NULL OR language_code IS NULL;
SELECT TOP 5 CONCAT (title,' by ',authors,' in ',language_code ) AS 'Books'
FROM dbo.books

8.  Update the query in question 7 using COALESCE to change the language code values from NULL to 'unknown'.

> A.  Has this changed the language\_code  where the values are NULL?
> 
> \\>Yes because we are changing it to unknown so know has a value.

In [ ]:
-- Code here:
--WHERE language_code IS NULL
SELECT TOP 5 title +' by ' + authors +' in ' + COALESCE(language_code,'unknown') AS 'Books + Unknown'
FROM dbo.books

9\. Revisit question 7 using ISNULL instead of COALESCE.

> A.  Has this changed the language\_code  where the values are NULL?
> 
> \\>Yes, it will change because we are using NULL instead of a value.

In [ ]:
-- Code here:
--IS NULL
SELECT TOP 5 title +' by ' + authors +' in ' + ISNULL(language_code,'unknown') AS 'Books with NULL'
FROM dbo.books